#ifndef _CONFIGURATION_H
#define _CONFIGURATION_H

#include "includes.h"



///*=================================================
//*函数名称：DS1302_W_Byte
//*函数功能：DS1302写一字节数据
//*输入：dat：要写入的数据
//=================================================*/
//void DS1302_W_Byte(unsigned char dat);

///*=================================================
//*函数名称：DS1302_R_Byte
//*函数功能：DS1302读一字节
//*输出：dat：读取的数据
//=================================================*/
//unsigned char DS1302_R_Byte();

///*=================================================
//*函数名称：DS1302_W_DAT
//*函数功能：写DS1302数据一次写2个字节
//*说明：先写命令后写数据
//*调用：DS1302_W_Byte()
//*输入：cmd：需要写的命令 ，dat：需要些的数据
//=================================================*/
//void DS1302_W_DAT(unsigned char cmd, unsigned char dat);

///*=================================================
//*函数名称：DS1302_R_DAT
//*函数功能：读DS1302数据
//*说明：先写入命令字节后读出对应数据
//*调用：	DS1302_W_Byte();DS1302_R_Byte();
//*输入：	cmd：需要写的命令
//*输出：	dat：读出的数据
//=================================================*/
//unsigned char DS1302_R_DAT(unsigned char cmd);

///*=================================================
//*函数名称：DS1302_Clear_WP
//*函数功能：清除DS1302写保护
//*说明：先写入命令0x8e（写控制寄存器）接着向该寄存器写0
//*调用：DS1302_W_DAT()
//=================================================*/
//void DS1302_Clear_WP();

///*=================================================
//*函数名称：DS1302_Clear_WP
//*函数功能：设置DS1302写保护
//*说明：先写入命令0x8e（写控制寄存器）接着向该寄存器写0x80
//*调用：DS1302_W_DAT()
//=================================================*/
//void DS1302_Set_WP();

///*=================================================
//*函数名称：Set_DS1302_Time
//*函数功能：设置DS1302时钟日历数据
//*说明：把时钟日历暂存数组TimeData数据转换为BCD码并
//	   写入到DS1302时钟日历寄存器中
//*调用：DS1302_Clear_WP();DS1302_W_DAT();DS1302_Set_WP();
//*输入：addr:需要写入寄存器的地址 ，TimeData数组：时钟日历初始值
//=================================================*/
//void Set_DS1302_Time(unsigned char addr);

///*=================================================
//*函数名称：Read_DS1302_Time
//*函数功能：读取DS1302时钟数据
//*说明：	读取DS1302时钟数据 返回数据存入时钟日历暂存
//		数组TimeData（数据格式BCD码）
//*调用：DS1302_Clear_WP();DS1302_R_DAT();DS1302_Set_WP();
//*输入：	addr：需要读取时钟日历寄存器的起始地址
//=================================================*/
//void Read_DS1302_Time(unsigned char addr);


//unsigned char IntToString(unsigned char *str, int dat);

#endif